data_generation/simulation_results/case_40/constant/simParams
nIter 2000;
hComponent0 829.4300846647374;
hComponent1 3523.39725001684;
hComponent2 4196.380666160799;
hComponent3 1154.9818955610863;
hComponent4 3942.562962930823;kComponent0 12.045980317342277;
kComponent1 80.49855168159249;
kComponent2 90.91870161111333;
kComponent3 55.526497531869005;
kComponent4 11.67555589166212;
tAmbient 300;
Ux 1.734150546317727;
kPCB 0.13325780464040832;